Repository: futurable/futural
Catalog: bank/locale/*/LC_MESSAGES/messages.po
Languages: fi_fi

source: Check loan amount
fi_fi: Tarkista lainan määrä

source: Check repayment
fi_fi: Tarkista maksuerän määrä

source: Check instalment
fi_fi: Tarkista lyhennyksen määrä

source: Check endDate
fi_fi: Tarkista loppumispäivämäärä

source: Check repicient name
fi_fi: Tarkista saajan nimi

source: Check sum
fi_fi: Tarkista summa

source: Check event date
fi_fi: Tarkista eräpäivä

source: Check reference number
fi_fi: Tarkista viitenumero

source: Error while opening file. Please contact administration
fi_fi: Virhe avattaessa tiedostoa. Ole hyvä ja ota yhteyttä ylläpitoon

source: File successfully saved
fi_fi: Tiedosto tallennettu onnistuneesti

source: Loan applications
fi_fi: Lainahakemukset

source: Make a new loan application
fi_fi: Tee uusi lainahakemus

source: Admin loan applications view
fi_fi: Ylläpitäjän lainahakemukset-näkymä

source: New loan application
fi_fi: Uusi lainahakemus

source: Make a loan application
fi_fi: Tee lainahakemus

source: Amount of loan
fi_fi: Lainan määrä

source: Insert the amount of the loan you want to apply
fi_fi: Anna anottavan lainan määrä

source: Loan type
fi_fi: Lainatyyppi

source: Select the loan repayment type
fi_fi: Valitse lainan takaisinmaksutapa

source: Repayment
fi_fi: Maksuerä

source: Repayment amount
fi_fi: Takaisinmaksun määrä

source: Instalment
fi_fi: Lyhennys

source: Instalment amount
fi_fi: Lyhennyksen määrä

source: Loan term
fi_fi: Laina-aika

source: Loan length
fi_fi: Lainan pituus

source: Interval of repayment
fi_fi: Maksuväli

source: Select how often you would like to make repayments
fi_fi: Valitse kuinka usein haluat tehdä lyhennyksiä

source: Interest type
fi_fi: Korkotyyppi

source: Select the interest type you want to use
fi_fi: Valitse haluttu koron tyyppi

source: Cancel
fi_fi: Peruuta

source: Continue
fi_fi: Jatka

source: days
fi_fi: päivää

source: weeks
fi_fi: viikkoa

source: months
fi_fi: kuukautta

source: Confirm loan application information
fi_fi: Hyväksy lainahakemuksen tiedot

source: Loan Term
fi_fi: Laina-aika

source: Confirm
fi_fi: Hyväksy

source: Check loan application information
fi_fi: Tarkista lainahakemuksen tiedot

source: Loan application is saved.
fi_fi: Lainahakemus on tallennettu.

source: Go to loan applications
fi_fi: Mene lainahakemuksiin

source: or
fi_fi: tai

source: return to front page
fi_fi: palaa etusivulle

source: An error occured! Please try again in a moment.
fi_fi: Virhe suorittaessa toimintoa! Ole hyvä ja yritä hetken päästä uudelleen.

source: Repayment info
fi_fi: Takaisinmaksu

source: Repayment interval
fi_fi: Maksuväli

source: Loan status
fi_fi: Lainan tila

source: Delete
fi_fi: Poista

source: Accept
fi_fi: Hyväksy

source: Decline
fi_fi: Hylkää

source: No open loan applications
fi_fi: Ei avoimia lainahakemuksia

source: Loan counter
fi_fi: Lainalaskuri

source: Loan amount
fi_fi: Lainan määrä

source: Interest
fi_fi: Korko

source: Real Amount
fi_fi: Todellinen määrä

source: Fixed interest
fi_fi: Kiinteä korko

source: 1 month euribor
fi_fi: 1 kk euribor

source: 3 month euribor
fi_fi: 3 kk euribor

source: Day
fi_fi: Päivä

source: Week
fi_fi: Viikko

source: Month
fi_fi: Kuukausi

source: years
fi_fi: vuotta

source: Open
fi_fi: Avoin

source: Granted
fi_fi: Myönnetty

source: Denied
fi_fi: Evätty

source: Active
fi_fi: Aktiivinen

source: Declined
fi_fi: Hylätty

source: Paid
fi_fi: Maksettu

source: Passive
fi_fi: Passiivinen

source: Paused
fi_fi: Tauolla

source: Removed
fi_fi: Poistettu

source: Bank loans
fi_fi: Lainat

source: Accept Date
fi_fi: Hyväksymispvm

source: Sum
fi_fi: Summa

source: Loan account IBAN
fi_fi: Lainatilin IBAN-numero

source: Details
fi_fi: Tiedot

source: Payment plan
fi_fi: Maksusuunnitelma

source: View
fi_fi: Tarkastele

source: You dont have bank loan accounts
fi_fi: Ei aktiivisia lainatilejä

source: Event Date
fi_fi: Eräpäivä

source: Recipient name
fi_fi: Saajan nimi

source: Recipient bank account
fi_fi: Saajan IBAN

source: Payer name
fi_fi: Maksajan nimi

source: Payer bank account
fi_fi: Maksajan IBAN

source: Message
fi_fi: Viesti

source: No transactions in this loan account yet
fi_fi: Lainatilillä ei ole tapahtumia

source: Bank loan account
fi_fi: Lainatili

source: Grant date
fi_fi: Myöntämispvm

source: Accept date
fi_fi: Hyväksymispvm

source: Interest rate
fi_fi: Korkoprosentti

source: Interest margin
fi_fi: Korkomarginaali

source: Interest total
fi_fi: Koron osuus

source: Principal
fi_fi: Pääoma

source: Admin transactions view
fi_fi: Ylläpitäjän tilitapahtumat -näkymä

source: Bank account transactions
fi_fi: Tilitapahtumat

source: Give start date
fi_fi: Anna aloituspäivämäärä

source: Give end date
fi_fi: Anna lopetuspäivämäärä

source: Start date is not correct (format dd.mm.yyyy)
fi_fi: Alkupäivämäärä on virheellinen (anna muodossa pp.kk.vvvv)

source: End date is not correct (format dd.mm.yyyy)
fi_fi: Loppupäivämäärä on virheellinen (anna muodossa pp.kk.vvvv)

source: Start date can not be later than end date
fi_fi: Alkupäivämäärä ei voi olla päättymispäivämäärän jälkeen

source: End date can not be in future
fi_fi: Loppupäivämäärä ei voi olla tulevaisuudessa

source: Choose bank account and time range
fi_fi: Valitse pankkitili ja aikaväli

source: Bank account
fi_fi: Pankkitili

source: Start date
fi_fi: Aloituspvm

source: End date
fi_fi: Loppupvm

source: Start Date
fi_fi: Aloituspvm

source: Get Transactions
fi_fi: Hae tapahtumat

source: Company
fi_fi: Yhtiö

source: Bank transactions by period
fi_fi: Pankkitapahtumat aikavälillä

source: Reference number
fi_fi: Viitenumero

source: Transaction total
fi_fi: Tapahtumien summa

source: No bank transactions by period
fi_fi: Ei pankkitapahtumia aikavälillä

source: Signed in
fi_fi: Kirjautuneena sisään

source: Fixed repayment
fi_fi: Kiinteä tasaerä

source: Fixed Instalment
fi_fi: Tasalyhennys

source: Annuity (ARM)
fi_fi: Annuiteetti

source: Due payments
fi_fi: Erääntyvät maksut

source: Transaction delete successful
fi_fi: Tapahtuman poisto onnistui

source: Transaction delete not successful
fi_fi: Tapahtuman poisto onnistui

source: Delete payment
fi_fi: Poista maksu

source: Due payments total
fi_fi: Erääntyvien maksujen summa

source: Welcome to Futural Bank!
fi_fi: Tervetuloa Futural pankkiin!

source: This is the front page for Futural Bank
fi_fi: Tämä on Futural pankin etusivu

source: Login to Futural Bank
fi_fi: Kirjaudu Futural pankkiin

source: Username
fi_fi: Käyttäjännimi

source: Password
fi_fi: Salasana

source: Login
fi_fi: Kirjaudu

source: Username or password was incorrect
fi_fi: Käyttäjännimi tai salasana oli virheellinen

source: You were logged out due inactivity
fi_fi: Sinut kirjattiin ulos automaattisesti

source: Front page
fi_fi: Etusivu

source: Open new account
fi_fi: Perusta uusi tili

source: Account information
fi_fi: Tilin tiedot

source: New transaction
fi_fi: Uusi maksu

source: Passive accounts
fi_fi: Passiiviset tilit

source: Transactions
fi_fi: Tilitapahtumat

source: Log out
fi_fi: Kirjaudu ulos

source: Payments for due
fi_fi: Erääntyvät maksut

source: Loans
fi_fi: Lainat

source: SEPA payments
fi_fi: SEPA-maksut

source: Are you sure you want to log out?
fi_fi: Oletko varma että haluat kirjautua ulos?

source: New account
fi_fi: Uusi tili

source: You have insufficient privileges to display this page
fi_fi: Sinulla ei ole oikeuksia tarkastella tätä sivua

source: If you think you should be able to view this content, please contact administation
fi_fi: Jos mielestäsi sinulla pitäisi olla oikeudet sivun tarkasteluun, ota yhteyttä ylläpitoon

source: Saving account successful
fi_fi: Tilin tallennus onnistui

source: Saving account failed
fi_fi: Tilin tallennus epäonnistui

source: Check the account information
fi_fi: Tarkista tilin tiedot

source: Owner info
fi_fi: Omistajan tiedot

source: Account owner
fi_fi: Tilin omistaja

source: Account owner name
fi_fi: Tilin omistajan nimi

source: Account name
fi_fi: Tilin nimi

source: Account status
fi_fi: Tilin tila

source: Create account
fi_fi: Luo pankkitili

source: Erronous account owner.
fi_fi: Virheellinen tilin omistaja

source: Erronous account owner name.
fi_fi: Virheellinen tilin omistajan nimi.

source: Erronous account name.
fi_fi: Virheellinen tilin nimi.

source: Erronous IBAN number.
fi_fi: Virheellinen IBAN numero.

source: Erronous BIC number.
fi_fi: Virheellinen BIC numero.

source: Erronous interest rate.
fi_fi: Virheellinen korkoprosentti

source: Erronous status.
fi_fi: Virheellinen lainan tila

source: New payment
fi_fi: Uusi maksu

source: Bank account saldo is insufficient
fi_fi: Tilin saldo ei riitä

source: Payment done
fi_fi: Maksu tehty

source: Make new payment
fi_fi: Tee uusi maksu

source: Go back to front page
fi_fi: Palaa etusivulle

source: Something went wrong. Please, try again later.
fi_fi: Jotain meni pieleen. Ole hyvä ja yritä uudelleen

source: Give recipient IBAN
fi_fi: Anna saajan IBAN

source: Recipient IBAN
fi_fi: Saajan IBAN

source: Check recipient account
fi_fi: Tarkista saajan tili

source: Given IBAN has an unknown bank SWIFT.
fi_fi: Annetun IBAN koodin SWIFT-osa on tuntematon.

source: External payments are not supported.
fi_fi: Ulkoiset maksut ei ole tuettu.

source: Payer info
fi_fi: Maksajan tiedot

source: Payer IBAN
fi_fi: Maksajan IBAN

source: Recipient info
fi_fi: Saajan tiedot

source: Recipient BIC
fi_fi: Saajan BIC

source: Payment info
fi_fi: Maksun tiedot

source: Due date
fi_fi: Eräpäivä

source: Extra loan repayment
fi_fi: Ylimääräinen lainan lyhennys

source: The page you were trying to find doesn't exist
fi_fi: Hakemaasi sivua ei löydy

source: Create payments from SEPA-formatted XML-file
fi_fi: Tee maksuja SEPA-pankkiaineistosta

source: Create transactions
fi_fi: Tee tapahtumat

source: No file selected.
fi_fi: Ei valittua tiedostoa.

source: You can only upload valid XML-formatted SEPA payments
fi_fi: Voit luoda tapahtumia vain valideista XML-muotoilluista SEPA-aineistoista

source: Payments saved.
fi_fi: Maksutapahtumat tallennettu.

source: Download bank statement in SEPA-format
fi_fi: Lataa tilitapahtumat SEPA-muodossa

source: Download statement
fi_fi: Lataa tapahtumat

source: The SEPA payment data you gave is for another bank.
fi_fi: Antamasi SEPA-aineisto on eri pankkiin.

source: You can only make payments from accounts you own.
fi_fi: Voit tehdä maksuja vain omistamiltasi tileiltä

source: External payments are not yet supported.
fi_fi: Ulkoisia maksuja ei vielä tueta.

source: Sorry for the inconvenience.
fi_fi: Pahoittelemme häiriötä.

source: Only Euro payments are supported.
fi_fi: Vain Euromaksut on tuettu.

source: Payment ID
fi_fi: Tapahtuma

source: is invalid and was not saved.
fi_fi: on viallinen, eikä sitä voitu tallentaa.

source: You have errors in you payment data. No transactions were made.
fi_fi: Maksuaineisto on viallinen. Tapahtumia ei voitu luoda.
