Repository: futurable/futural
Catalog: tax/locale/*/LC_MESSAGES/messages.po
Languages: fi_fi

source: Please use valid event date!
fi_fi: Ole hyvä, ja tarkista tapahtumapäivämäärä!

source: Own payment
fi_fi: Oma maksu

source: Please use numeric values!
fi_fi: Ole hyvä, ja käytä numeerisia arvoja.

source: Count
fi_fi: Laske

source: Returnable/payable tax
fi_fi: Maksettava vero / Palautukseen oikeuttava vero

source: Tax payer
fi_fi: Verovelvollinen

source: Notifier
fi_fi: Ilmoittaja

source: Value added tax
fi_fi: Arvonlisävero

source: Declaration period
fi_fi: Ilmoitusjakso

source: Target season
fi_fi: Kohdekausi

source: Month
fi_fi: Kuukausi

source: 23% tax
fi_fi: 23 %:n vero

source: 13% tax
fi_fi: 13 %:n vero

source: 9% tax
fi_fi: 9 %:n vero

source: Tax from products from EU
fi_fi: Vero tavaraostoista muista EU-maista

source: Tax from services from EU
fi_fi: Vero palveluostoista muista EU-maista

source: Tax from construction services (reverse charge)
fi_fi: Vero rakentamispalvelun ostoista (käännetty verovelvollisuus)

source: Deductible tax
fi_fi: Kohdekauden vähennettävä vero

source: Sales, 0% tax
fi_fi: 0-verokannan alainen liikevaihto

source: Product sales to EU
fi_fi: Tavaran myynti muihin EU-maihin

source: Service sales to EU
fi_fi: Palveluiden myynti muihin EU-maihin

source: Product purchase from EU
fi_fi: Tavaraostot muista EU-maista

source: Service purchase from EU
fi_fi: Palveluostot muista EU-maista

source: Sales from construction services (reverse charge)
fi_fi: Rakentamispalvelun myynnit (käännetty verovelvollisuus)

source: Purchases from construction services (reverce charge)
fi_fi: Rakentamispalvelun ostot (käännetty verovelvollisuus)

source: Logout
fi_fi: Kirjaudu ulos

source: Choose company
fi_fi: Valitse asiakas

source: January
fi_fi: tammikuu

source: February
fi_fi: helmikuu

source: March
fi_fi: maaliskuu

source: April
fi_fi: huhtikuu

source: May
fi_fi: toukokuu

source: June
fi_fi: kesäkuu

source: July
fi_fi: heinäkuu

source: August
fi_fi: elokuu

source: September
fi_fi: syyskuu

source: October
fi_fi: lokakuu

source: November
fi_fi: marraskuu

source: December
fi_fi: joulukuu

source: Monday
fi_fi: maanantai

source: Tuesday
fi_fi: tiistai

source: Wednesday
fi_fi: keskiviikko

source: Thursday
fi_fi: torstai

source: Friday
fi_fi: perjantai

source: Saturday
fi_fi: lauantai

source: Sunday
fi_fi: sunnuntai

source: Declaration - correcting sent declarations
fi_fi: Ilmoittaminen - Ilmoitettujen tietojen korjaaminen

source: VAT declaration information
fi_fi: Ilmoitettavat tiedot

source: Declaration is successful.
fi_fi: Ilmoituksen tekeminen onnistui.

source: Error while creating declaration. Please, try again
fi_fi: Virhe ilmoitusta tehtäessä. Ole hyvä ja yritä myöhemmin uudelleen

source: Target period
fi_fi: Kohdekausi

source: Sent
fi_fi: Lähetetty

source: Declaration
fi_fi: Ilmoitus

source: Make extra declaration
fi_fi: Tee ylimääräinen ilmoitus

source: There are no transactions yet
fi_fi: Ei tapahtumia

source: Euros
fi_fi: Euroa

source: TODO: Vero kotimaan myynnistä verokannoittain
fi_fi: Vero kotimaan myynnistä verokannoittain

source: Cancel
fi_fi: Peruuta

source: Continue
fi_fi: Jatka

source: Check that information is correct before sending the declaration.
fi_fi: Tarkista ilmoitettavien tietojen oikeellisuus ja lähetä ilmoitus.

source: If needed you can change the information.
fi_fi: Tarvittaessa ilmoitettavia tietoja voi vielä muuttaa.

source: Correct declaration
fi_fi: Muuta tietoja

source: Save
fi_fi: Tallenna

source: Customer information
fi_fi: Asiakastiedot

source: Basic information
fi_fi: Perustiedot

source: Name
fi_fi: Nimi

source: Business ID
fi_fi: Y-tunnus

source: Reporting information
fi_fi: Ilmoitusjakson tiedot

source: Current declaration period information
fi_fi: Voimassa olevat ilmoitusjaksotiedot

source: VAT declarations
fi_fi: ALV-ilmoitukset

source: Monthly
fi_fi: Kuukausittain

source: Employer contributions
fi_fi: Työnantajasuoritukset

source: Payment information
fi_fi: Maksamisen tiedot

source: Reference number must always be used when making payment to tax account
fi_fi: Verotilille maksettaessa on aina käytettävä viitenumeroa

source: Tax account payments customer-spesific reference number
fi_fi: Verotilimaksujen asiakaskohtainen viite

source: Bank account number for tax account payments
fi_fi: Verohallinnon tilinumerot verotilimaksuille

source: Bank
fi_fi: Pankki

source: Unprompted tax declarations
fi_fi: Oma-aloitteisten verojen ilmoittaminen

source: Value added tax, withholding tax and employers social security contributions are unprompted taxes that are declared for tax authorities via seasonal income tax declaration.
fi_fi: Arvonlisävero, ennakonpidätykset, työnantajan sosiaaliturvamaksu, lähdeverot, arpajaisvero ja vakuutusmaksuvero ovat oma-aloitteisia veroja, jotka ilmoitetaan Verohallinnolle kausiveroilmoituksella.

source: Declaration dates
fi_fi: Ilmoittamisen määräpäivät

source: Month as the declaration period
fi_fi: Ilmoitusjakso on kuukausi

source: The seasonal income tax declaration is due on 12. day of the month that the target period tax or payment declaration is due according the law.
fi_fi: Sähköinen kausiveroilmoitus on annettava viimeistään sen kalenterikuukauden 12. päivänä, jona kohdekauden vero tai maksu on kyseistä veroa koskevan lain mukaan ilmoitettava.

source: The next general due date is
fi_fi: Seuraava yleinen eräpäivä on

source: The next target period value added tax and employer contributions are due on this date.
fi_fi: Tällöin erääntyvät seuraavien kohdekausien arvonlisäverot ja työnantajasuoritukset.

source: Declaration - Employer contributions declaration
fi_fi: Ilmoittaminen - Työnantajasuoritusten ilmoittaminen

source: Something wrong. Please try again later.
fi_fi: Jotakin on pielessä. Ole hyvä ja yritä myöhemmin uudelleen.

source: Employer contribution declaration information
fi_fi: Ilmoitettavat tiedot

source: Tax account status
fi_fi: Verotilin tilanne

source: Saldo status
fi_fi: Saldotilanne

source: Tax account saldo
fi_fi: Verotilin saldo

source: Transactions
fi_fi: Tilitapahtumat

source: Login to Futural Tax
fi_fi: Kirjaudu Futural Verottajaan

source: Username
fi_fi: Käyttäjännimi

source: Password
fi_fi: Salasana

source: Login
fi_fi: Kirjaudu

source: Tax account transactions - monthly summary
fi_fi: Verotilin tapahtumat - Kuukausiyhteenvedot

source: Date
fi_fi: Päivämäärä

source: Transaction / message
fi_fi: Tilitapahtuma / selite

source: Amount
fi_fi: Summa

source: Charges
fi_fi: Veloitukset

source: Credits
fi_fi: Hyvitykset

source: Transactions total
fi_fi: Tilitapahtumat yhteensä

source: There are no transactions
fi_fi: Ei tilitapahtumia.

source: All transactions
fi_fi: Kaikki tilitapahtumat

source: Select month
fi_fi: Valitse kuukausi

source: Select company
fi_fi: Valitse asiakas

source: Front page
fi_fi: Etusivu

source: Tax account events
fi_fi: Verotilin tapahtumat

source: Account transactions
fi_fi: Kirjatut tilitapahtumat

source: Monthly summary
fi_fi: Kuukausiyhteenvedot

source: Tax declarations
fi_fi: Ilmoittaminen

source: VAT declaration
fi_fi: Arvonlisäveron ilmoittaminen

source: Employer's contributions
fi_fi: Työnantajasuoritusten ilmoittaminen

source: Correcting declarations
fi_fi: Ilmoitettujen tietojen korjaaminen

source: Customer selection
fi_fi: Asiakkaan valinta

source: Select customer to manage
fi_fi: Valitse käsiteltävä asiakas

source: BusinessID
fi_fi: Y-tunnus

source: Company name
fi_fi: Nimi

source: Access rights
fi_fi: Käyttöoikeudet

source: Browsing the tax account and making seasonal tax declarations
fi_fi: Verotilin selaaminen ja kausiveroilmoittaminen

source: Tax account transactions - registered transactions
fi_fi: Verotilin tapahtumat - Kirjatut tilitapahtumat

source: Transaction
fi_fi: Tapahtuma

source: Sum
fi_fi: Summa

source: TODO: maksamatta
fi_fi: Maksamatta

source: Declaration - Value added tax declaration
fi_fi: Ilmoittaminen - Arvonlisäveron ilmoittaminen
